#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoudiniEngineRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "HoudiniEngineRuntime_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// Class HoudiniEngineRuntime.HoudiniAsset
// 0x0028 (0x0058 - 0x0030)
class UHoudiniAsset final : public UObject
{
public:
	class FString                                 AssetFileName;                                     // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 AssetBytes;                                        // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint32                                        AssetBytesCount;                                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAssetLimitedCommercial;                           // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAssetNonCommercial;                               // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAssetExpanded;                                    // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAsset")
	}
	static class UHoudiniAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAsset>();
	}
};
DUMPER7_ASSERTS_UHoudiniAsset;

// Class HoudiniEngineRuntime.HoudiniAssetActor
// 0x0008 (0x02B0 - 0x02A8)
class AHoudiniAssetActor final : public AActor
{
public:
	class UHoudiniAssetComponent*                 HoudiniAssetComponent;                             // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetActor")
	}
	static class AHoudiniAssetActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHoudiniAssetActor>();
	}
};
DUMPER7_ASSERTS_AHoudiniAssetActor;

// Class HoudiniEngineRuntime.HoudiniAssetComponent
// 0x04B0 (0x09B0 - 0x0500)
class UHoudiniAssetComponent : public UPrimitiveComponent
{
public:
	uint8                                         Pad_500[0x8];                                      // 0x0500(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UHoudiniAsset*                          HoudiniAsset;                                      // 0x0508(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookOnParameterChange;                            // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUploadTransformsToHoudiniEngine;                  // 0x0511(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookOnTransformChange;                            // 0x0512(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookOnAssetInputCook;                             // 0x0513(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputless;                                       // 0x0514(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputTemplateGeos;                               // 0x0515(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOutputNodes;                                   // 0x0516(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_517[0x1];                                      // 0x0517(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDirectoryPath                         TemporaryCookFolder;                               // 0x0518(0x0010)(NativeAccessSpecifierPublic)
	struct FDirectoryPath                         BakeFolder;                                        // 0x0528(0x0010)(NativeAccessSpecifierPublic)
	EHoudiniStaticMeshMethod                      StaticMeshMethod;                                  // 0x0538(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHoudiniStaticMeshGenerationProperties StaticMeshGenerationProperties;                    // 0x0540(0x01B8)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMeshBuildSettings                     StaticMeshBuildSettings;                           // 0x06F8(0x0030)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideGlobalProxyStaticMeshSettings;            // 0x0728(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshOverride;                    // 0x0729(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshRefinementByTimerOverride;   // 0x072A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72B[0x1];                                      // 0x072B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProxyMeshAutoRefineTimeoutSecondsOverride;         // 0x072C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshRefinementOnPreSaveWorldOverride; // 0x0730(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshRefinementOnPreBeginPIEOverride; // 0x0731(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_732[0x2];                                      // 0x0732(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AssetId;                                           // 0x0734(0x0004)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<int32>                                 NodeIdsToCook;                                     // 0x0738(0x0010)(ZeroConstructor, Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	TMap<int32, int32>                            OutputNodeCookCounts;                              // 0x0748(0x0050)(Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	TSet<class UHoudiniAssetComponent*>           DownstreamHoudiniAssets;                           // 0x0798(0x0050)(ExportObject, DuplicateTransient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FGuid                                  ComponentGUID;                                     // 0x07E8(0x0010)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  HapiGUID;                                          // 0x07F8(0x0010)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 HapiAssetName;                                     // 0x0808(0x0010)(ZeroConstructor, DuplicateTransient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniAssetState                            AssetState;                                        // 0x0818(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniAssetState                            DebugLastAssetState;                               // 0x0819(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniAssetStateResult                      AssetStateResult;                                  // 0x081A(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_81B[0x1];                                      // 0x081B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        SubAssetIndex;                                     // 0x081C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         AssetCookCount;                                    // 0x0820(0x0004)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasBeenLoaded;                                    // 0x0824(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasBeenDuplicated;                                // 0x0825(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPendingDelete;                                    // 0x0826(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRecookRequested;                                  // 0x0827(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRebuildRequested;                                 // 0x0828(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableCooking;                                    // 0x0829(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceNeedUpdate;                                  // 0x082A(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLastCookSuccess;                                  // 0x082B(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bParameterDefinitionUpdateNeeded;                  // 0x082C(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBlueprintStructureModified;                       // 0x082D(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBlueprintModified;                                // 0x082E(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_82F[0x1];                                      // 0x082F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHoudiniParameter*>              Parameters;                                        // 0x0830(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UHoudiniInput*>                  Inputs;                                            // 0x0840(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UHoudiniOutput*>                 Outputs;                                           // 0x0850(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FHoudiniBakedOutput>            BakedOutputs;                                      // 0x0860(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AActor>>          UntrackedOutputs;                                  // 0x0870(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UHoudiniHandleComponent*>        HandleComponents;                                  // 0x0880(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          bHasComponentTransformChanged;                     // 0x0890(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFullyLoaded;                                      // 0x0891(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_892[0x6];                                      // 0x0892(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHoudiniPDGAssetLink*                   PDGAssetLink;                                      // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                           RefineMeshesTimer;                                 // 0x08A0(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8A8[0x18];                                     // 0x08A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bNoProxyMeshNextCookRequested;                     // 0x08C0(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C1[0x7];                                      // 0x08C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UObject*, int32>                   InputPresets;                                      // 0x08C8(0x0050)(Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	bool                                          bBakeAfterNextCook;                                // 0x0918(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_919[0x5F];                                     // 0x0919(0x005F)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCachedIsPreview;                                  // 0x0978(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_979[0xF];                                      // 0x0979(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LastTickTime;                                      // 0x0988(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_990[0x20];                                     // 0x0990(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetComponent")
	}
	static class UHoudiniAssetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetComponent>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetComponent;

// Class HoudiniEngineRuntime.HoudiniAssetBlueprintComponent
// 0x00F0 (0x0AA0 - 0x09B0)
class UHoudiniAssetBlueprintComponent final : public UHoudiniAssetComponent
{
public:
	uint8                                         Pad_9B0[0x40];                                     // 0x09B0(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          FauxBPProperty;                                    // 0x09F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHoudiniAssetChanged;                              // 0x09F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUpdatedFromTemplate;                              // 0x09F2(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsInBlueprintEditor;                              // 0x09F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanDeleteHoudiniNodes;                            // 0x09F4(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasRegisteredComponentTemplate;                   // 0x09F5(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9F6[0xA];                                      // 0x09F6(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FHoudiniOutputObjectIdentifier, struct FGuid> CachedOutputNodes;                     // 0x0A00(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<struct FGuid, struct FGuid>              CachedInputNodes;                                  // 0x0A50(0x0050)(Protected, NativeAccessSpecifierProtected)

public:
	bool HasParameter(const class FString& Name_0);
	void SetFloatParameter(const class FString& Name_0, float Value, int32 Index_0);
	void SetToggleValueAt(const class FString& Name_0, bool Value, int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetBlueprintComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetBlueprintComponent")
	}
	static class UHoudiniAssetBlueprintComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetBlueprintComponent>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetBlueprintComponent;

// Class HoudiniEngineRuntime.HoudiniAssetParameter
// 0x0058 (0x0088 - 0x0030)
class UHoudiniAssetParameter : public UObject
{
public:
	uint8                                         Pad_30[0x58];                                      // 0x0030(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameter")
	}
	static class UHoudiniAssetParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameter>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameter;

// Class HoudiniEngineRuntime.HoudiniAssetParameterButton
// 0x0000 (0x0088 - 0x0088)
class UHoudiniAssetParameterButton final : public UHoudiniAssetParameter
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterButton")
	}
	static class UHoudiniAssetParameterButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterButton>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterButton;

// Class HoudiniEngineRuntime.HoudiniAssetParameterChoice
// 0x0038 (0x00C0 - 0x0088)
class UHoudiniAssetParameterChoice final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_88[0x38];                                      // 0x0088(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterChoice")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterChoice")
	}
	static class UHoudiniAssetParameterChoice* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterChoice>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterChoice;

// Class HoudiniEngineRuntime.HoudiniAssetParameterColor
// 0x0010 (0x0098 - 0x0088)
class UHoudiniAssetParameterColor final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_88[0x10];                                      // 0x0088(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterColor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterColor")
	}
	static class UHoudiniAssetParameterColor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterColor>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterColor;

// Class HoudiniEngineRuntime.HoudiniAssetParameterFile
// 0x0028 (0x00B0 - 0x0088)
class UHoudiniAssetParameterFile final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_88[0x28];                                      // 0x0088(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterFile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterFile")
	}
	static class UHoudiniAssetParameterFile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterFile>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterFile;

// Class HoudiniEngineRuntime.HoudiniAssetParameterFloat
// 0x0038 (0x00C0 - 0x0088)
class UHoudiniAssetParameterFloat final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_88[0x38];                                      // 0x0088(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterFloat")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterFloat")
	}
	static class UHoudiniAssetParameterFloat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterFloat>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterFloat;

// Class HoudiniEngineRuntime.HoudiniAssetParameterFolder
// 0x0000 (0x0088 - 0x0088)
class UHoudiniAssetParameterFolder final : public UHoudiniAssetParameter
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterFolder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterFolder")
	}
	static class UHoudiniAssetParameterFolder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterFolder>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterFolder;

// Class HoudiniEngineRuntime.HoudiniAssetParameterFolderList
// 0x0000 (0x0088 - 0x0088)
class UHoudiniAssetParameterFolderList final : public UHoudiniAssetParameter
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterFolderList")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterFolderList")
	}
	static class UHoudiniAssetParameterFolderList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterFolderList>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterFolderList;

// Class HoudiniEngineRuntime.HoudiniAssetParameterInt
// 0x0030 (0x00B8 - 0x0088)
class UHoudiniAssetParameterInt final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_88[0x30];                                      // 0x0088(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterInt")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterInt")
	}
	static class UHoudiniAssetParameterInt* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterInt>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterInt;

// Class HoudiniEngineRuntime.HoudiniAssetParameterLabel
// 0x0000 (0x0088 - 0x0088)
class UHoudiniAssetParameterLabel final : public UHoudiniAssetParameter
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterLabel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterLabel")
	}
	static class UHoudiniAssetParameterLabel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterLabel>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterLabel;

// Class HoudiniEngineRuntime.HoudiniAssetParameterMultiparm
// 0x0008 (0x0090 - 0x0088)
class UHoudiniAssetParameterMultiparm final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterMultiparm")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterMultiparm")
	}
	static class UHoudiniAssetParameterMultiparm* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterMultiparm>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterMultiparm;

// Class HoudiniEngineRuntime.HoudiniAssetParameterRamp
// 0x0018 (0x00A0 - 0x0088)
class UHoudiniAssetParameterRamp final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_88[0x18];                                      // 0x0088(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterRamp")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterRamp")
	}
	static class UHoudiniAssetParameterRamp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterRamp>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterRamp;

// Class HoudiniEngineRuntime.HoudiniAssetParameterSeparator
// 0x0000 (0x0088 - 0x0088)
class UHoudiniAssetParameterSeparator final : public UHoudiniAssetParameter
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterSeparator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterSeparator")
	}
	static class UHoudiniAssetParameterSeparator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterSeparator>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterSeparator;

// Class HoudiniEngineRuntime.HoudiniAssetParameterString
// 0x0010 (0x0098 - 0x0088)
class UHoudiniAssetParameterString final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_88[0x10];                                      // 0x0088(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterString")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterString")
	}
	static class UHoudiniAssetParameterString* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterString>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterString;

// Class HoudiniEngineRuntime.HoudiniAssetParameterToggle
// 0x0010 (0x0098 - 0x0088)
class UHoudiniAssetParameterToggle final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_88[0x10];                                      // 0x0088(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterToggle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterToggle")
	}
	static class UHoudiniAssetParameterToggle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterToggle>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterToggle;

// Class HoudiniEngineRuntime.HoudiniAssetComponentMaterials_V1
// 0x00A0 (0x00D0 - 0x0030)
class UHoudiniAssetComponentMaterials_V1 final : public UObject
{
public:
	uint8                                         Pad_30[0xA0];                                      // 0x0030(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetComponentMaterials_V1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetComponentMaterials_V1")
	}
	static class UHoudiniAssetComponentMaterials_V1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetComponentMaterials_V1>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetComponentMaterials_V1;

// Class HoudiniEngineRuntime.HoudiniHandleComponent_V1
// 0x0090 (0x02C0 - 0x0230)
class UHoudiniHandleComponent_V1 final : public USceneComponent
{
public:
	uint8                                         Pad_228[0x98];                                     // 0x0228(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniHandleComponent_V1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniHandleComponent_V1")
	}
	static class UHoudiniHandleComponent_V1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniHandleComponent_V1>();
	}
};
DUMPER7_ASSERTS_UHoudiniHandleComponent_V1;

// Class HoudiniEngineRuntime.HoudiniSplineComponent_V1
// 0x00F0 (0x0320 - 0x0230)
class UHoudiniSplineComponent_V1 final : public USceneComponent
{
public:
	uint8                                         Pad_228[0xF8];                                     // 0x0228(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniSplineComponent_V1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniSplineComponent_V1")
	}
	static class UHoudiniSplineComponent_V1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniSplineComponent_V1>();
	}
};
DUMPER7_ASSERTS_UHoudiniSplineComponent_V1;

// Class HoudiniEngineRuntime.HoudiniAssetInput
// 0x0128 (0x01B0 - 0x0088)
class UHoudiniAssetInput final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_88[0x128];                                     // 0x0088(0x0128)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetInput")
	}
	static class UHoudiniAssetInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetInput>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetInput;

// Class HoudiniEngineRuntime.HoudiniAssetInstanceInput
// 0x00E8 (0x0170 - 0x0088)
class UHoudiniAssetInstanceInput final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_88[0xE8];                                      // 0x0088(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetInstanceInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetInstanceInput")
	}
	static class UHoudiniAssetInstanceInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetInstanceInput>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetInstanceInput;

// Class HoudiniEngineRuntime.HoudiniAssetInstanceInputField
// 0x0160 (0x0190 - 0x0030)
class UHoudiniAssetInstanceInputField final : public UObject
{
public:
	uint8                                         Pad_30[0x160];                                     // 0x0030(0x0160)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetInstanceInputField")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetInstanceInputField")
	}
	static class UHoudiniAssetInstanceInputField* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetInstanceInputField>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetInstanceInputField;

// Class HoudiniEngineRuntime.HoudiniAssetComponent_V1
// 0x0530 (0x0A30 - 0x0500)
class UHoudiniAssetComponent_V1 final : public UPrimitiveComponent
{
public:
	uint8                                         bGeneratedDoubleSidedGeometry : 1;                 // 0x0500(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      GeneratedPhysMaterial;                             // 0x0508(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBodyInstance                          DefaultBodyInstance;                               // 0x0510(0x0168)(Edit, NativeAccessSpecifierPublic)
	ECollisionTraceFlag                           GeneratedCollisionTraceFlag;                       // 0x0678(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_679[0x3];                                      // 0x0679(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GeneratedLightMapResolution;                       // 0x067C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GeneratedDistanceFieldResolutionScale;             // 0x0680(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWalkableSlopeOverride                 GeneratedWalkableSlopeOverride;                    // 0x0684(0x0010)(Edit, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	int32                                         GeneratedLightMapCoordinateIndex;                  // 0x0694(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bGeneratedUseMaximumStreamingTexelRatio : 1;       // 0x0698(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_699[0x3];                                      // 0x0699(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GeneratedStreamingDistanceMultiplier;              // 0x069C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFoliageType_InstancedStaticMesh*       GeneratedFoliageDefaultSettings;                   // 0x06A0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAssetUserData*>                 GeneratedAssetUserData;                            // 0x06A8(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)
	class FText                                   BakeFolder;                                        // 0x06B8(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   TempCookFolder;                                    // 0x06D0(0x0018)(NativeAccessSpecifierPublic)
	uint8                                         Pad_6E8[0x348];                                    // 0x06E8(0x0348)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetComponent_V1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetComponent_V1")
	}
	static class UHoudiniAssetComponent_V1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetComponent_V1>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetComponent_V1;

// Class HoudiniEngineRuntime.HoudiniInstancedActorComponent_V1
// 0x0010 (0x0240 - 0x0230)
class UHoudiniInstancedActorComponent_V1 final : public USceneComponent
{
public:
	uint8                                         Pad_228[0x18];                                     // 0x0228(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInstancedActorComponent_V1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInstancedActorComponent_V1")
	}
	static class UHoudiniInstancedActorComponent_V1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInstancedActorComponent_V1>();
	}
};
DUMPER7_ASSERTS_UHoudiniInstancedActorComponent_V1;

// Class HoudiniEngineRuntime.HoudiniMeshSplitInstancerComponent_V1
// 0x0020 (0x0250 - 0x0230)
class UHoudiniMeshSplitInstancerComponent_V1 final : public USceneComponent
{
public:
	uint8                                         Pad_228[0x28];                                     // 0x0228(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniMeshSplitInstancerComponent_V1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniMeshSplitInstancerComponent_V1")
	}
	static class UHoudiniMeshSplitInstancerComponent_V1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniMeshSplitInstancerComponent_V1>();
	}
};
DUMPER7_ASSERTS_UHoudiniMeshSplitInstancerComponent_V1;

// Class HoudiniEngineRuntime.HoudiniEngineCopyPropertiesInterface
// 0x0000 (0x0000 - 0x0000)
class IHoudiniEngineCopyPropertiesInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniEngineCopyPropertiesInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniEngineCopyPropertiesInterface")
	}
	static class IHoudiniEngineCopyPropertiesInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHoudiniEngineCopyPropertiesInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IHoudiniEngineCopyPropertiesInterface;

// Class HoudiniEngineRuntime.HoudiniHandleParameter
// 0x0010 (0x0040 - 0x0030)
class UHoudiniHandleParameter final : public UObject
{
public:
	class UHoudiniParameter*                      AssetParameter;                                    // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TupleIndex;                                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniHandleParameter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniHandleParameter")
	}
	static class UHoudiniHandleParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniHandleParameter>();
	}
};
DUMPER7_ASSERTS_UHoudiniHandleParameter;

// Class HoudiniEngineRuntime.HoudiniHandleComponent
// 0x0030 (0x0260 - 0x0230)
class UHoudiniHandleComponent final : public USceneComponent
{
public:
	TArray<class UHoudiniHandleParameter*>        XformParms;                                        // 0x0228(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UHoudiniHandleParameter*                RSTParm;                                           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHoudiniHandleParameter*                RotOrderParm;                                      // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniHandleType                            HandleType;                                        // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 HandleName;                                        // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniHandleComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniHandleComponent")
	}
	static class UHoudiniHandleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniHandleComponent>();
	}
};
DUMPER7_ASSERTS_UHoudiniHandleComponent;

// Class HoudiniEngineRuntime.HoudiniInput
// 0x01D0 (0x0200 - 0x0030)
class UHoudiniInput final : public UObject
{
public:
	class FString                                 Name_0;                                            // 0x0030(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 Label;                                             // 0x0040(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniInputType                             Type;                                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniInputType                             PreviousType;                                      // 0x0051(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AssetNodeId;                                       // 0x0054(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InputNodeId;                                       // 0x0058(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InputIndex;                                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ParmId;                                            // 0x0060(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsObjectPathParameter;                            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CreatedDataNodeIds;                                // 0x0068(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, Protected, NativeAccessSpecifierProtected)
	bool                                          bHasChanged;                                       // 0x0078(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNeedsToTriggerUpdate;                             // 0x0079(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Help;                                              // 0x0080(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniXformType                             KeepWorldTransform;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPackBeforeMerge;                                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bImportAsReference;                                // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bImportAsReferenceRotScaleEnabled;                 // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExportLODs;                                       // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExportSockets;                                    // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExportColliders;                                  // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCookOnCurveChanged;                               // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UHoudiniInputObject*>            GeometryInputObjects;                              // 0x0098(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bStaticMeshChanged;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHoudiniInputObject*>            AssetInputObjects;                                 // 0x00B0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bInputAssetConnectedInHoudini;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHoudiniInputObject*>            CurveInputObjects;                                 // 0x00C8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                         DefaultCurveOffset;                                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAddRotAndScaleAttributesOnCurves;                 // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHoudiniInputObject*>            LandscapeInputObjects;                             // 0x00E0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bLandscapeHasExportTypeChanged;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHoudiniInputObject*>            WorldInputObjects;                                 // 0x00F8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         WorldInputBoundSelectorObjects;                    // 0x0108(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsWorldInputBoundSelector;                        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWorldInputBoundSelectorAutoUpdate;                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UnrealSplineResolution;                            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UHoudiniInputObject*>            SkeletalInputObjects;                              // 0x0120(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSet<class ULandscapeComponent*>              LandscapeSelectedComponents;                       // 0x0130(0x0050)(ExportObject, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSet<int32>                                   InputNodesPendingDelete;                           // 0x0180(0x0050)(Transient, DuplicateTransient, NonTransactional, Protected, NativeAccessSpecifierProtected)
	TArray<class UHoudiniInputHoudiniSplineComponent*> LastInsertedInputs;                           // 0x01D0(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	TArray<class UHoudiniInputObject*>            LastUndoDeletedInputs;                             // 0x01E0(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, NativeAccessSpecifierPublic)
	bool                                          bUpdateInputLandscape;                             // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniLandscapeExportType                   LandscapeExportType;                               // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeExportSelectionOnly;                     // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeAutoSelectComponent;                     // 0x01F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeExportMaterials;                         // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeExportLighting;                          // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeExportNormalizedUVs;                     // 0x01F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeExportTileUVs;                           // 0x01F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanDeleteHoudiniNodes;                            // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInput")
	}
	static class UHoudiniInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInput>();
	}
};
DUMPER7_ASSERTS_UHoudiniInput;

// Class HoudiniEngineRuntime.HoudiniInputObject
// 0x0090 (0x00C0 - 0x0030)
#pragma pack(push, 0x1)
class alignas(0x10) UHoudiniInputObject : public UObject
{
public:
	TSoftObjectPtr<class UObject>                 InputObject;                                       // 0x0030(0x0030)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x0060(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EHoudiniInputObjectType                       Type;                                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InputNodeId;                                       // 0x0094(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InputObjectNodeId;                                 // 0x0098(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x009C(0x0010)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasChanged;                                       // 0x00AC(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNeedsToTriggerUpdate;                             // 0x00AD(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTransformChanged;                                 // 0x00AE(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bImportAsReference;                                // 0x00AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bImportAsReferenceRotScaleEnabled;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanDeleteHoudiniNodes;                            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
